app/views/jobs/show.html.erb

SELECT "milestones".* FROM "milestones" WHERE "milestones"."job_id" = $1  ORDER BY "milestones"."id" ASC  [["job_id", 13]]
---
      <hr class="hr">
      <% @job.milestones.each do |milestone| %>