app/controllers/jobs_controller.rb

  def create
    @job = Job.new(job_params)

    #Adds milestones to job
    milestone_title = ["Apply", "Email", "Interview"]
    milestone_title.each do |mil_title|
      milestone = Milestone.new({title: mil_title})
      @job.milestones << milestone
---
INSERT INTO "milestones" ("title", "status", "job_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Apply"], ["status", "f"], ["job_id", 9], ["created_at", "2016-02-22 05:39:41.126194"], ["updated_at", "2016-02-22 05:39:41.126194"]]

  def update
    set_job
    if current_user == @job.user
      if @job.update_attributes(job_params)
        flash[:notice] = "Successfully updated job info"
        redirect_to job_path(@job)
      else
        flash[:error] = @job.error.full_messages.join(", ")
---
SELECT "users".* FROM "users"