app/controllers/milestones_controller.rb

  def create
    job = Job.find_by_id(milestone_params[:job_id])
    @milestone = Milestone.new(title: milestone_params[:title], status: false)
    job.milestones << @milestone
---
INSERT INTO "milestones" ("title", "status", "job_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Become a super hero"], ["status", "f"], ["job_id", 13], ["created_at", "2016-02-22 22:27:13.746999"], ["updated_at", "2016-02-22 22:27:13.746999"]]

  def destroy
    set_mil
    @milestone.destroy
---
DELETE FROM "milestones" WHERE "milestones"."id" = $1  [["id", 748]]

    def set_mil
      @milestone = Milestone.find(params[:id])
---
SELECT  "milestones".* FROM "milestones" WHERE "milestones"."id" = $1 LIMIT 1  [["id", 748]]