app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "interest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "users" SET "interest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["interest", "{{}}"], ["updated_at", "2016-02-19 22:09:14.197257"], ["id", 2]]
---
  def create
    fixed_interest = user_params[:interest]
    params = user_params
    params[:interest] = fixed_interest.split(" ")
    @user = User.create(params)
    if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]
---
  def destroy
    set_user
    if current_user == @user
      @user.destroy